OpenPuya/PY32T020_Firmware/Drivers/PY32T020_HAL_Driver/Src/py32t020_hal_uart.c
  /* Reset ErrorCode */
  huart->ErrorCode = HAL_UART_ERROR_NONE;

  /* Restore huart->gState and huart->RxState to Ready */
  huart->gState  = HAL_UART_STATE_READY;
  huart->RxState = HAL_UART_STATE_READY;

  /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort complete callback */
  huart->AbortCpltCallback(huart);
#else
  /* Call legacy weak Abort complete callback */
  HAL_UART_AbortCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

  return HAL_OK;
}

/**
  * @brief  Abort ongoing Transmit transfer (Interrupt mode).
  * @param  huart UART handle.
  * @note   This procedure could be used for aborting any ongoing Tx transfer started in Interrupt mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Tx)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_UART_AbortTransmit_IT(UART_HandleTypeDef *huart)
{
  /* Disable the UART BUSYERR status interrupt and Transfer Hold Register empty Interrupt */
  __HAL_UART_DISABLE_IT(huart, (UART_IT_BUSY_ERR | UART_IT_TDRE));

  /* Reset Tx transfer counter */
  huart->TxXferCount = 0x00U;

  /* Restore huart->gState to Ready */
  huart->gState = HAL_UART_STATE_READY;

  /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Transmit Complete Callback */
  huart->AbortTransmitCpltCallback(huart);
#else
  /* Call legacy weak Abort Transmit Complete Callback */
  HAL_UART_AbortTransmitCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

  return HAL_OK;
}

/**
  * @brief  Abort ongoing Receive transfer (Interrupt mode).
  * @param  huart UART handle.
  * @note   This procedure could be used for aborting any ongoing Rx transfer started in Interrupt mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Rx)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_UART_AbortReceive_IT(UART_HandleTypeDef *huart)
{
  /* Disable the UART BUSYERR status interrupt , Receiver line status interrupt, 
             and Data Register not empty Interrupt */
  __HAL_UART_DISABLE_IT(huart, (UART_IT_BUSY_ERR | UART_IT_LS | UART_IT_RXNE));

  /* Reset Rx transfer counter */
  huart->RxXferCount = 0x00U;

  /* Restore huart->RxState to Ready */
  huart->RxState = HAL_UART_STATE_READY;

  /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Receive Complete Callback */
  huart->AbortReceiveCpltCallback(huart);
#else
  /* Call legacy weak Abort Receive Complete Callback */
  HAL_UART_AbortReceiveCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

  return HAL_OK;
}

/**
  * @brief  This function handles UART interrupt request.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @note   Depending on devices and packages, DMA may not be available.
  *         Refer to device datasheet for DMA availability.
  * @retval None
  */
void HAL_UART_IRQHandler(UART_HandleTypeDef *huart)
{
  uint32_t isrflags   = READ_REG(huart->Instance->SR);
  uint32_t cr2its     = READ_REG(huart->Instance->CR2);
  uint32_t errorflags = 0x00U;

  /* If no error occurs */
  errorflags = (isrflags & (uint32_t)(UART_SR_ORE | UART_SR_PE | UART_SR_FE | UART_SR_BUSY_ERR));
  if (errorflags == RESET)
  {
    /* UART in mode Receiver -------------------------------------------------*/
    if (((isrflags & UART_SR_RXNE) != RESET) && ((cr2its & UART_CR2_RXNEIE) != RESET))
    {
      UART_Receive_IT(huart);
      return;
    }
  }
  
  /* If Break frame detection interrupt occurred*/
  if (((isrflags & UART_SR_BRI) != RESET) && ((cr2its & UART_CR2_LSIE) != RESET))
  {
    /* Clear Flag */
    __HAL_UART_CLEAR_FLAG(huart, UART_FLAG_BRI);

    /* Call callback */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->BreakFrameCallback(huart);
#else
    HAL_UART_BreakFrameCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
  }
  
  /* If address matching interrupt occurred*/
  if (((isrflags & UART_SR_ADDR_RCVD) != RESET) && ((cr2its & UART_CR2_LSIE) != RESET))
  {
    /* Clear Flag */
    __HAL_UART_CLEAR_FLAG(huart, UART_FLAG_ADDR_RCVD);

    /* Call callback */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->AddrMatchCallback(huart);
#else
    HAL_UART_AddrMatchCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
  }

  /* If some errors occur */
  if ((errorflags != RESET) && ((cr2its & (UART_CR2_LSIE | UART_CR2_BUSYERRIE | UART_CR2_RXNEIE)) != RESET))
  {
    /* UART Over-Run interrupt occurred --------------------------------------*/
    if (((isrflags & UART_SR_ORE) != RESET) && ((cr2its & UART_CR2_LSIE) != RESET))
    {
      /* Clear Flag */
      __HAL_UART_CLEAR_FLAG(huart, UART_FLAG_ORE);
      
      huart->ErrorCode |= HAL_UART_ERROR_ORE;
    }
    
    /* UART parity error interrupt occurred ----------------------------------*/
    if (((isrflags & UART_SR_PE) != RESET) && ((cr2its & UART_CR2_LSIE) != RESET))
    {
      /* Clear Flag */
      __HAL_UART_CLEAR_FLAG(huart, UART_FLAG_PE);
      
      huart->ErrorCode |= HAL_UART_ERROR_PE;
    }

